Reports/ОтчетПоИсковому.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ОтчетПоИсковому</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КолонкаКредитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Должник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредитор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтадииИсковогоПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтадииИсковогоПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаИД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИскПоданВСуд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИдетСудебныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынесеноРешение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденоМС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленаОтсрочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтИска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обжалование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоРешениеСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученыИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СостоянияДел</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтИска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленаОтсрочка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоСвидетельство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречисленыДенежныеСредства</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТипыМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ТипыМероприятий</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКИДляИсходящегоЗвонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКИ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаПечатиШаблона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОтображатьВПланировщике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияДопДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииДополнительныхДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияПередСозданиемИзБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоВыполнение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРассылки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДействийДляСкоринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРассылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИДляРассылки</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тсВидыПечатныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаОтправкиСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСМС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстаДляАвтоинформирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаПрикрепленияФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФайла</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьВОтчетФССП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаПрикрепитьФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящаяКорреспонденция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КнопкаПлатежныеСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ПодразделенияОрганизаций</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>Трейд Софт - не переносим</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОператора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоРуководитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Comment>Трейд Софт</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаниеИзменений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтслеживаниеИзменений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСправочникРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСправочникаДляПодбора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапросаРабочегоСтола</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодбораОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетПоИсковому/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
    Макет = Отчеты.ОтчетПоИсковому.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.ПериодОтчетаС = Строка(Формат(НачалоПериода, "ДЛФ=Д"));
	ОбластьЗаголовок.Параметры.ПериодОтчетаПо = Строка(Формат(КонецПериода, "ДЛФ=Д"));
	ТабДок.Вывести(ОбластьЗаголовок);		
	
	ОбластьШапка = ?(Отчет.КолонкаКредитор, Макет.ПолучитьОбласть("Шапка1"), Макет.ПолучитьОбласть("Шапка"));
	ТабДок.Вывести(ОбластьШапка);
		
	ТабДок.ФиксацияСверху = 4;
	ОбластьДанных = ?(Отчет.КолонкаКредитор, Макет.ПолучитьОбласть("ДанныеОтчета1"), Макет.ПолучитьОбласть("ДанныеОтчета"));
	
	//Подготовка таблицы с ДО подходящими по стадии
	ТипыМ = Новый Массив();
	ТипыМ.Добавить(Справочники.ТипыМероприятий.ПустаяСсылка());
	ТипыМ.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0068"));
	ТипыМ.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0069"));
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	                      |			,
	                      |			Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	                      |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект.Владелец
	                      |			И ((НЕ Мероприятие.ПометкаУдаления))
	                      |			И ((НЕ Мероприятие.ТипМероприятия В (&ТипыМ)))
	                      |			И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	                      |					И Мероприятие.БизнесПроцесс.РезультатБПНаименование <> ""Отменено"")
	                      |			И ((НЕ Мероприятие.Объект.ОшибкаИД))
	                      |ГДЕ
	                      |	Мероприятие.Ссылка ЕСТЬ NULL ");
	Запрос.УстановитьПараметр("ТипыМ", ТипыМ);
	ТаблицаДО = Запрос.Выполнить().Выгрузить();
	ОтобратьПоСтадии(ТаблицаДО);
	
	Если Должник.Пустая() И Контрагент.Пустая() И Кредитор.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДО.ДолговоеОбязательство,
		               |	ТаблицаДО.СтадияФлаг
		               |ПОМЕСТИТЬ ТаблицаДО
		               |ИЗ
		               |	&ТаблицаДО КАК ТаблицаДО";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТаблицаДО.ДолговоеОбязательство,
		               |	ТаблицаДО.СтадияФлаг
		               |ПОМЕСТИТЬ ТаблицаДОВрем
		               |ИЗ
		               |	&ТаблицаДО КАК ТаблицаДО
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТаблицаДОВрем.ДолговоеОбязательство,
		               |	ТаблицаДОВрем.СтадияФлаг
		               |ПОМЕСТИТЬ ТаблицаДО
		               |ИЗ
		               |	ТаблицаДОВрем КАК ТаблицаДОВрем
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.Контрагенты КАК ДолговыеОбязательстваКонтрагенты
		               |		ПО ТаблицаДОВрем.ДолговоеОбязательство = ДолговыеОбязательстваКонтрагенты.Ссылка
		               |			И (ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Должник)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Должник
		               |				ИЛИ ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Контрагент)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Контрагент
		               |				ИЛИ ДолговыеОбязательстваКонтрагенты.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ВидыКонтрагентов.Кредитор)
		               |					И ДолговыеОбязательстваКонтрагенты.Значение = &Кредитор)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТаблицаДОВрем.ДолговоеОбязательство,
		               |	ТаблицаДОВрем.СтадияФлаг
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(*) >= &КолВо";	
		Запрос.УстановитьПараметр("Должник", Должник);
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("Кредитор", Кредитор);
		Запрос.УстановитьПараметр("КолВо", Число(Не Должник.Пустая()) + Число(Не Контрагент.Пустая()) + 
				Число(Не Кредитор.Пустая()));
	КонецЕсли;
	Запрос.УстановитьПараметр("ТаблицаДО", ТаблицаДО);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.ВыполнитьПакет();
	//
		
	///////////////////////////////////////
	// Выбор должника и номера закладной //
	///////////////////////////////////////
	Если Сотрудник.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецДолжник КАК Должник,
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецКредитор КАК Кредитор,
		               |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство,
		               |	ОбъектыВРаботеОстатки.Объект.Должник КАК ДолжникНаименование,
		               |	ОбъектыВРаботеОстатки.Объект.Кредитор КАК КредиторНаименование,
		               |	ТаблицаДО.СтадияФлаг
		               |ИЗ
		               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |			&ДатаОтчета,
		               |			Подразделение = &Подразделение
		               |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)
		               |				И (Объект = &ДолговоеОбязательство
		               |					ИЛИ &ПустоеДО)) КАК ОбъектыВРаботеОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДО КАК ТаблицаДО
		               |		ПО ОбъектыВРаботеОстатки.Объект = ТаблицаДО.ДолговоеОбязательство
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДопРеквизитыРегион
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДопРеквизитыРегион.Ссылка
		               |			И (ДопРеквизитыРегион.Свойство.Код = ""     0125"")
		               |			И (ДопРеквизитыРегион.Значение = &Регион
		               |				ИЛИ &НеЗаполненРегион)
		               |ГДЕ
		               |	(НЕ ОбъектыВРаботеОстатки.Объект.ПометкаУдаления)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Должник";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецДолжник КАК Должник,
		               |	ОбъектыВРаботеОстатки.Объект.ВладелецКредитор КАК Кредитор,
		               |	ОбъектыВРаботеОстатки.Объект КАК ДолговоеОбязательство,
		               |	ОбъектыВРаботеОстатки.Объект.Должник КАК ДолжникНаименование,
		               |	ОбъектыВРаботеОстатки.Объект.Кредитор КАК КредиторНаименование,
		               |	ТаблицаДО.СтадияФлаг
		               |ИЗ
		               |	РегистрНакопления.ОбъектыВРаботе.Остатки(
		               |			&ДатаОтчета,
		               |			Подразделение = &Подразделение
		               |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяССылка)
		               |				И (Объект = &ДолговоеОбязательство
		               |					ИЛИ &ПустоеДО)) КАК ОбъектыВРаботеОстатки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДО КАК ТаблицаДО
		               |		ПО ОбъектыВРаботеОстатки.Объект = ТаблицаДО.ДолговоеОбязательство
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		               |		ПО ОбъектыВРаботеОстатки.Объект = ОтветственныеСотрудники.Объект
		               |			И (ОтветственныеСотрудники.Пользователь = &Пользователь)
		               |			И (ОтветственныеСотрудники.ТипСотрудника.Код = ""     0002"")
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК ДопРеквизитыРегион
		               |		ПО ОбъектыВРаботеОстатки.Объект = ДопРеквизитыРегион.Ссылка
		               |			И (ДопРеквизитыРегион.Свойство.Код = ""     0125"")
		               |			И (ДопРеквизитыРегион.Значение = &Регион
		               |				ИЛИ &НеЗаполненРегион)
		               |ГДЕ
		               |	(НЕ ОбъектыВРаботеОстатки.Объект.ПометкаУдаления)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Должник";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Должник", Должник);
	Запрос.УстановитьПараметр("ДолговоеОбязательство", ДолговоеОбязательство);
	Запрос.УстановитьПараметр("ПустоеДО", ДолговоеОбязательство.Пустая());
	Запрос.УстановитьПараметр("Регион", Регион);
	Запрос.УстановитьПараметр("НеЗаполненРегион", Регион.Пустая());
	
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0221"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0183"));	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0222"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0184"));
	Запрос.УстановитьПараметр("РезультатМС", МассивРезультатовМС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	НомерЗаписи = 0;
	Пока Выборка.Следующий() Цикл
		НомерЗаписи = НомерЗаписи + 1;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Мероприятие.ТипМероприятия,
		               |	Мероприятие.ФактическаяДата КАК ФактическаяДата,
		               |	Мероприятие.Комментарий,
		               |	Мероприятие.Ссылка
		               |ИЗ
		               |	Задача.Мероприятие КАК Мероприятие
		               |ГДЕ
		               |	Мероприятие.ФактическаяДата МЕЖДУ &НачалоПериода И &КонецПериода
		               |	И Мероприятие.Выполнена
		               |	И (Мероприятие.Объект = &ДО
	                   |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
		               |	И (НЕ Мероприятие.ПометкаУдаления)
		               |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		               |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)) 
	                   |	И НЕ Мероприятие.ВыполненоКакНеАктуальное
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ФактическаяДата";
		Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));
		Запрос.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Выборка2 = Запрос.Выполнить().Выбрать();
		
		
		СтрокаДействий = "";
		Если Сред(Выборка.СтадияФлаг, 1, 1) = "1" Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	Мероприятие.Результат.Код КАК Код
			               |ИЗ
			               |	Задача.Мероприятие КАК Мероприятие
			               |ГДЕ
			               |	Мероприятие.Выполнена
			               |	И Мероприятие.Результат В(&РезультатМС)
			               |	И (Мероприятие.Объект = &ДО
	                       |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
			               |	И Мероприятие.ДатаВыполнения < &ТекДата
			               |	И (НЕ Мероприятие.ПометкаУдаления)
			               |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
			               |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Мероприятие.ФактическаяДата";
			Результат3 = Запрос.Выполнить().Выбрать();
			ТекМС = Ложь;
			Пока Результат3.Следующий() Цикл
				Если Результат3.Код = "     0220" ИЛИ Результат3.Код = "     0315" Тогда
					ТекМС = Истина;
					СтрокаДействий = СтрокаДействий + "УТВЕРЖДЕНО МИРОВОЕ СОГЛАШЕНИЕ" + Символы.ПС;
				ИначеЕсли (Результат3.Код = "     0221" ИЛИ Результат3.Код = "     0183") И ТекМС Тогда
					ТекМС = Ложь;
					СтрокаДействий = СокрЛП(СтрокаДействий) + ", ИСПОЛНЕНО" + Символы.ПС;
				ИначеЕсли (Результат3.Код = "     0222" ИЛИ Результат3.Код = "     0184") И ТекМС Тогда
					ТекМС = Ложь;
					СтрокаДействий = СокрЛП(СтрокаДействий) + ", НЕ ИСПОЛНЕНО" + Символы.ПС;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 2, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ОТКАЗ ОТ ИСКА" + Символы.ПС;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 3, 1) = "1" Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	МероприятиеДополнительныеРеквизиты.Ссылка,
			               |	МероприятиеДополнительныеРеквизиты.Значение
			               |ИЗ
			               |	Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
			               |ГДЕ
			               |	(МероприятиеДополнительныеРеквизиты.Ссылка.Объект = &ДО
			               |			ИЛИ МероприятиеДополнительныеРеквизиты.Ссылка.Объект.Владелец = &ДО)
			               |	И МероприятиеДополнительныеРеквизиты.Ссылка.Выполнена
			               |	И МероприятиеДополнительныеРеквизиты.Свойство = &Свойство
			               |	И МероприятиеДополнительныеРеквизиты.Значение >= &ТекДата
			               |	И МероприятиеДополнительныеРеквизиты.Ссылка.ДатаВыполнения < &ТекДата
			               |	И НЕ МероприятиеДополнительныеРеквизиты.Ссылка.ПометкаУдаления
			               |	И (МероприятиеДополнительныеРеквизиты.Ссылка.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
			               |			ИЛИ НЕ МероприятиеДополнительныеРеквизиты.Ссылка.БизнесПроцесс.ПометкаУдаления)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	МероприятиеДополнительныеРеквизиты.Значение";
			Запрос.УстановитьПараметр("Свойство", 
					ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
			Результат3 = Запрос.Выполнить().Выбрать();
			Пока Результат3.Следующий() Цикл
				СтрокаДействий = СтрокаДействий + "ПРЕДОСТАВЛЕНА ОТСРОЧКА ДО " + Формат(Результат3.Значение, "ДЛФ=D") + Символы.ПС;
			КонецЦикла;	
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 4, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ПОЛУЧЕНО СВИДЕТЕЛЬСТВО О РЕГИСТРАЦИИ ПРАВА СОБСТВЕННОСТИ" + Символы.ПС;
		КонецЕсли;
		Если Сред(Выборка.СтадияФлаг, 5, 1) = "1" Тогда
			СтрокаДействий = СтрокаДействий + "ПЕРЕЧИСЛЕНЫ ДЕНЕЖНЫЕ СРЕДСТВА" + Символы.ПС;
		КонецЕсли;
		ОбластьДанных.Параметры.Комментарии = СокрЛП(СтрокаДействий);
		
		
		//СтрСокр_0 - текущий комментарий
		//СтрСокр_1 - результат функции комментария
		//Стр_0 - предыдущий комментарий
		//Стр_1 - предыдущий результат функции комментария
		Номер = 1;
		Стр_0 = "";	
		Стр_1 = "";
		Стр_ = "";
		СтрокаДействий = "";
		Пока Выборка2.Следующий() Цикл
			СтрСокр_0 = СокрЛП(Выборка2.Комментарий);
			СтрСокр_1 = ?(Выборка2.Ссылка.Результат.ШаблонКомментария.Пустая(), "", 
					Справочники.ФункцииКомментариев.ВычислитьФункцию(
						Выборка2.Ссылка.Результат.ШаблонКомментария.Функция, Выборка2.Ссылка, ""));
			
			Если СтрСокр_0 <> "" И Стр_0 <> СтрСокр_0 И (Стр_1 <> СтрСокр_1 ИЛИ СтрСокр_1 = "") И Стр_ <> СтрСокр_0 Тогда
				Стр = Формат(Номер, "ЧГ=") + ") " + СтрСокр_0;
				СтрокаДействий = СтрокаДействий + Стр + Символы.ПС;
				Номер = Номер + 1;
				Стр_0 = СтрСокр_0;
				Стр_1 = СтрСокр_1;
				Стр_ = СтрСокр_0;
				
			ИначеЕсли СтрСокр_0 = "" И СтрСокр_1 <> "" И Стр_1 <> СтрСокр_1 И Стр_ <> СтрСокр_1 Тогда
				Стр = Формат(Номер, "ЧГ=") + ") " + СтрСокр_1;
				СтрокаДействий = СтрокаДействий + Стр + Символы.ПС;
				Номер = Номер + 1;
				Стр_0 = СтрСокр_1;
				Стр_1 = СтрСокр_1;
				Стр_ = СтрСокр_1;
				
			Иначе
				Стр_1 = СтрСокр_1;			
			КонецЕсли;		
		КонецЦикла;
		
		
		ОбластьДанных.Параметры.Номер = НомерЗаписи; 
		ОбластьДанных.Параметры.Должник = Выборка.Должник;
		ОбластьДанных.Параметры.ДолжникРас = Выборка.ДолжникНаименование;
		Если Отчет.КолонкаКредитор Тогда
			ОбластьДанных.Параметры.Кредитор = Выборка.Кредитор;		
			ОбластьДанных.Параметры.КредиторРас = Выборка.КредиторНаименование;
		КонецЕсли;
		ОбластьДанных.Параметры.ДолговоеОбязательство = Выборка.ДолговоеОбязательство;
		ОбластьДанных.Параметры.Действия = СокрЛП(СтрокаДействий);
			
		
		ЗапросМ = Новый Запрос("ВЫБРАТЬ
		                       |	ТабКод.КодТипаМероприятия,
		                       |	ТабКод.КодДопРеквизитаМероприятия,
		                       |	ТабКод.НомерКолонки,
		                       |	ТабКод.КодРезультата
		                       |ПОМЕСТИТЬ ТабКод
		                       |ИЗ
		                       |	&ТабКод КАК ТабКод
		                       |;
		                       |
		                       |////////////////////////////////////////////////////////////////////////////////
		                       |ВЫБРАТЬ
		                       |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
		                       |	Мероприятие.Схема КАК Схема,
		                       |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель,
		                       |	Мероприятие.ФактическаяДата,
		                       |	Мероприятие.ТипМероприятия.Код КАК ТипМероприятияКод,
		                       |	Мероприятие.Результат.Код КАК РезультатКод,
		                       |	МероприятиеДополнительныеРеквизиты.Свойство.Код КАК СвойствоКод,
		                       |	МероприятиеДополнительныеРеквизиты.Значение КАК Значение,
							   |	Мероприятие.Объект
		                       |ПОМЕСТИТЬ ТаблицаМ
		                       |ИЗ
		                       |	Задача.Мероприятие КАК Мероприятие
		                       |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
		                       |		ПО (МероприятиеДополнительныеРеквизиты.Ссылка = Мероприятие.Ссылка)
		                       |ГДЕ
		                       |	(Мероприятие.Объект = &ДО
		                       |			ИЛИ Мероприятие.Объект.Владелец = &ДО)
		                       |	И Мероприятие.ФактическаяДата <= &ДатаОтчета
		                       |	И (НЕ Мероприятие.ПометкаУдаления)
		                       |	И Мероприятие.Выполнена
		                       |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                       |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
		                       |	И (НЕ Мероприятие.ВыполненоКакНеАктуальное)");				
		ЗапросМ.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	    ЗапросМ.УстановитьПараметр("ТабКод", ТабКод.Выгрузить());
		ЗапросМ.УстановитьПараметр("ДО", Выборка.ДолговоеОбязательство);
		ЗапросМ.УстановитьПараметр("ДатаОтчета", КонецДня(ДатаОтчета));
	    ЗапросМ.ВыполнитьПакет();
		
		ОбластьДанных.Параметры.ДатаПодачиИЗ           = ЗаписатьКолонку(ЗапросМ, 0, Выборка.ДолговоеОбязательство, Истина);
		ОбластьДанных.Параметры.ДатаСудебногоЗаседания = ЗаписатьКолонку(ЗапросМ, 1, Выборка.ДолговоеОбязательство,, Истина);
		ОбластьДанных.Параметры.ДатаРешенияСуда        = ЗаписатьКолонку(ЗапросМ, 2, Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.ДатаВступленияВЗС      = ЗаписатьКолонку(ЗапросМ, 3, Выборка.ДолговоеОбязательство);
		ОбластьДанных.Параметры.СтадияИП = ВычислитьСтадиюИП(Выборка.ДолговоеОбязательство);
		
		ТабДок.Вывести(ОбластьДанных);		
	КонецЦикла;	
	
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ДатаОтчета = Строка(Формат(ДатаОтчета, "ДЛФ=Д"));
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаОтчета = ТекущаяДата();
	НачалоПериода = НачалоМесяца(ТекущаяДата());
	КонецПериода = ТекущаяДата();
	
	ЗаполнитьТаблицуКодов();
	
	ЗаполнитьСписокСтадий();
КонецПроцедуры

&НаСервере
Функция ЗаписатьКолонку(Запрос, НомерКолонки, ДО, ТолькоПервуюДату = Ложь, БезПовторовВПределахОбъектаРодителя = Ложь)
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТабКод.КодДопРеквизитаМероприятия = """"
	               |			ТОГДА Мероприятие.ФактическаяДата
	               |		ИНАЧЕ Мероприятие.Значение
	               |	КОНЕЦ КАК ДатаМероприятия,
	               |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
	               |	Мероприятие.Схема КАК Схема,
	               |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКод КАК ТабКод
	               |		ПО Мероприятие.ТипМероприятияКод = ТабКод.КодТипаМероприятия
	               |			И (ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ИЛИ Мероприятие.СвойствоКод = ТабКод.КодДопРеквизитаМероприятия)
	               |			И (ТабКод.НомерКолонки = &НомерКолонки)
	               |			И (Мероприятие.РезультатКод = ТабКод.КодРезультата
	               |				ИЛИ ТабКод.КодРезультата = """")
	               |ГДЕ
	               |	(Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМероприятия,
	               |	БизнесПроцесс,
	               |	Схема,
	               |	ОбъектРодитель";	
	Запрос.УстановитьПараметр("НомерКолонки", НомерКолонки);	
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаТМП = "";
	
	ТекОбъектРодитель = Неопределено;
	ТекДатаМероприятия = Неопределено;
	ТекСхема = Неопределено;
	ТекБП = Неопределено;
	Пока Результат.Следующий() Цикл
		Если БезПовторовВПределахОбъектаРодителя И ТекОбъектРодитель = Результат.ОбъектРодитель И 
				ТекДатаМероприятия = НачалоДня(Результат.ДатаМероприятия) И ТекСхема = Результат.Схема И 
				ТекБП = Результат.БизнесПроцесс И Не Результат.БизнесПроцесс.Пустая() Тогда
			Продолжить;
		КонецЕсли;
				
		СтрДата = Формат(Результат.ДатаМероприятия, "ДЛФ=Д");
		СтрокаТМП = СтрокаТМП + СтрДата + Символы.ПС;
		Если ТолькоПервуюДату Тогда
			Прервать;
		КонецЕсли;
		
		ТекОбъектРодитель = Результат.ОбъектРодитель;
		ТекДатаМероприятия = НачалоДня(Результат.ДатаМероприятия);
		ТекСхема = Результат.Схема;
		ТекБП = Результат.БизнесПроцесс;
	КонецЦикла;
    Возврат СокрЛП(СтрокаТМП);	
КонецФункции

&НаСервере
Функция ЗаписатьКолонкуПоследнююДатуПоКаждомуИД(Запрос, НомерКолонки, ДО)
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ТОГДА Мероприятие.ФактическаяДата
	               |			ИНАЧЕ Мероприятие.Значение
	               |		КОНЕЦ) КАК ДатаМероприятия,
	               |	Мероприятие.Объект
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКод КАК ТабКод
	               |		ПО Мероприятие.ТипМероприятияКод = ТабКод.КодТипаМероприятия
	               |			И (ТабКод.КодДопРеквизитаМероприятия = """"
	               |				ИЛИ Мероприятие.СвойствоКод = ТабКод.КодДопРеквизитаМероприятия)
	               |			И (ТабКод.НомерКолонки = &НомерКолонки)
	               |			И (Мероприятие.РезультатКод = ТабКод.КодРезультата
	               |				ИЛИ ТабКод.КодРезультата = """")
	               |ГДЕ
	               |	(Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	               |			ИЛИ НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Мероприятие.Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаМероприятия";	
	Запрос.УстановитьПараметр("НомерКолонки", НомерКолонки);	
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаТМП = "";
	
	Пока Результат.Следующий() Цикл			
		СтрДата = Формат(Результат.ДатаМероприятия, "ДЛФ=Д");
		СтрокаТМП = СтрокаТМП + СтрДата + Символы.ПС;
	КонецЦикла;
    Возврат СокрЛП(СтрокаТМП);	
КонецФункции

&НаСервере
Функция ВычислитьСтадиюИП(ДО)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.Результат,
	                      |	Мероприятие.Выполнена,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Результат.Код КАК РезультатКод,
	                      |	Мероприятие.ФактическаяДата,
	                      |	Мероприятие.ТипМероприятия
	                      |ПОМЕСТИТЬ ТаблицаМ
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.Объект = &Объект
	                      |	И (НЕ Мероприятие.ПометкаУдаления)
	                      |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))");
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("Объект", ДО);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));
	Запрос.ВыполнитьПакет();
	
	//13
	МассивРезультатовОИ = Новый Массив();
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0321"));
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0322"));
	Запрос.УстановитьПараметр("РезультатОИ", МассивРезультатовОИ);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И Мероприятие.Результат В(&РезультатОИ)
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	ТекОИ = Не Запрос.Выполнить().Пустой();			   
		
	//12			
	Запрос.Текст = "ВЫБРАТЬ
	               |	МероприятиеДополнительныеРеквизиты.Ссылка,
	               |	МероприятиеДополнительныеРеквизиты.Значение
	               |ИЗ
	               |	Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаМ КАК Мероприятие
	               |		ПО (Мероприятие.Ссылка = МероприятиеДополнительныеРеквизиты.Ссылка)
	               |ГДЕ
	               |	МероприятиеДополнительныеРеквизиты.Ссылка.Выполнена
	               |	И МероприятиеДополнительныеРеквизиты.Свойство = &СвойствоПО
	               |	И МероприятиеДополнительныеРеквизиты.Значение >= &ТекДата
	               |	И МероприятиеДополнительныеРеквизиты.Ссылка.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МероприятиеДополнительныеРеквизиты.Значение";
	Запрос.УстановитьПараметр("СвойствоПО", 
			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
	ТекПО = Не Запрос.Выполнить().Пустой();
			
	//11				
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0221"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0183"));	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0222"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0184"));
	Запрос.УстановитьПараметр("РезультатМС", МассивРезультатовМС);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И Мероприятие.Результат В(&РезультатМС)
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Результат3 = Запрос.Выполнить().Выбрать();
	ТекМС = Ложь;
	Пока Результат3.Следующий() Цикл
		Если Результат3.Код = "     0220" ИЛИ Результат3.Код = "     0315" Тогда
			ТекМС = Истина;
			//СтрокаДействий = СтрокаДействий + "УТВЕРЖДЕНО МИРОВОЕ СОГЛАШЕНИЕ" + Символы.ПС;
		ИначеЕсли (Результат3.Код = "     0221" ИЛИ Результат3.Код = "     0183") И ТекМС Тогда
			ТекМС = Ложь;
			//СтрокаДействий = СокрЛП(СтрокаДействий) + ", ИСПОЛНЕНО" + Символы.ПС;
		ИначеЕсли (Результат3.Код = "     0222" ИЛИ Результат3.Код = "     0184") И ТекМС Тогда
			ТекМС = Ложь;
			//СтрокаДействий = СокрЛП(СтрокаДействий) + ", НЕ ИСПОЛНЕНО" + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	//7
	МассивРезультатов7 = Новый Массив();	
	МассивРезультатов7.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0079"));
	МассивРезультатов7.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0151"));
	Запрос.УстановитьПараметр("Результат7", МассивРезультатов7);
	
	МассивТипов7 = Новый Массив();	
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0101"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0136"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0137"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0102"));
	МассивТипов7.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0134"));
	Запрос.УстановитьПараметр("Тип7", МассивТипов7);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И (Мероприятие.Результат В (&Результат7)
	               |			ИЛИ Мероприятие.ТипМероприятия В (&Тип7))
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек7 = Не Запрос.Выполнить().Пустой();
	
	//6
	МассивРезультатов6 = Новый Массив();	
	МассивРезультатов6.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0078"));
	Запрос.УстановитьПараметр("Результат6", МассивРезультатов7);
	
	МассивТипов6 = Новый Массив();	
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0088"));
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0135"));
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0218"));
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0047"));
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0104"));
	МассивТипов6.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0133"));	
	Запрос.УстановитьПараметр("Тип6", МассивТипов6);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И (Мероприятие.Результат В (&Результат6)
	               |			ИЛИ Мероприятие.ТипМероприятия В (&Тип6))
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек6 = Не Запрос.Выполнить().Пустой();

	//5	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	НЕ Мероприятие.Выполнена
	               |	И Мероприятие.ТипМероприятия.Родитель.Код = ""     0092""
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек5 = Не Запрос.Выполнить().Пустой();
	
	//1
	МассивТипов1 = Новый Массив();	
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0012"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0011"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0013"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0014"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0016"));
	МассивТипов1.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0010"));
	Запрос.УстановитьПараметр("Тип1", МассивТипов1);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.ТипМероприятия В (&Тип1)
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек1 = Не Запрос.Выполнить().Пустой();	
	
	//2
	МассивТипов2 = Новый Массив();	
	МассивТипов2.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0018"));
	МассивТипов2.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0022"));
	МассивТипов2.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0025"));
	МассивТипов2.Добавить(Справочники.ТипыМероприятий.НайтиПоКоду("     0020"));
	Запрос.УстановитьПараметр("Тип2", МассивТипов2);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И Мероприятие.ТипМероприятия В(&Тип2)
	               |	И Мероприятие.Результат.Код <> ""     0058""
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек2 = Не Запрос.Выполнить().Пустой();	
	
	//3
	МассивРезультатов3 = Новый Массив();	
	МассивРезультатов3.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0058"));
	МассивРезультатов3.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0147"));
	Запрос.УстановитьПараметр("Результат3", МассивРезультатов3);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И Мероприятие.Результат В(&Результат3)
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек3 = Не Запрос.Выполнить().Пустой();	
	
	//4
	МассивРезультатов4 = Новый Массив();	
	МассивРезультатов4.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0088"));
	Запрос.УстановитьПараметр("Результат4", МассивРезультатов4);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.Результат.Код КАК Код
	               |ИЗ
	               |	ТаблицаМ КАК Мероприятие
	               |ГДЕ
	               |	Мероприятие.Выполнена
	               |	И Мероприятие.Результат В(&Результат4)
	               |	И Мероприятие.ДатаВыполнения < &ТекДата
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Тек4 = Не Запрос.Выполнить().Пустой();	
	
	РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ПустаяСсылка();	
	Если ТекОИ Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ОтказОтИска;
	ИначеЕсли ТекПО Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ПредоставленаОтсрочка;
	ИначеЕсли ТекМС Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.УтвержденоМС;
	ИначеЕсли Тек7 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ПолученыИД;
	ИначеЕсли Тек6 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ПолученоРешениеСуда;
	ИначеЕсли Тек5 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.Обжалование;
	ИначеЕсли Тек4 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ВынесеноРешение;
	ИначеЕсли Тек3 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ИдетСудебныйПроцесс;
	ИначеЕсли Тек2 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ИскПоданВСуд;
	ИначеЕсли Тек1 Тогда
		РезультатВозврат = Перечисления.СтадииИсковогоПроизводства.ПодготовкаИД;
	КонецЕсли;
	
	Возврат Строка(РезультатВозврат);
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуКодов()
	ТабКод.Очистить();
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0018";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2033"; //"";
	НоваяСтрока.НомерКолонки = 0;
	НоваяСтрока.КодРезультата = "";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0019";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0023";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0055";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0126";
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0048";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0072";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0020";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0048";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0095";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0096";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0148";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0100";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0120";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0127";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0086";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "     0179";
	
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0088";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0050";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0141";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0142";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0143";	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2037"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0182";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2037"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "     0180";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "     0038";
	НоваяСтрока.КодДопРеквизитаМероприятия = "     2027"; //"";
	НоваяСтрока.НомерКолонки = 3;
	НоваяСтрока.КодРезультата = "     0041";
КонецПроцедуры

&НаКлиенте
Процедура РегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	 Параметр  = Новый ПараметрВыбора("Отбор.Владелец", НайтиПВХПоКоду("     0125")) ;
	 НовыйМассив = Новый Массив();
	 НовыйМассив.Добавить(Параметр);
	 НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	 Элементы.Регион.ПараметрыВыбора = НовыеПараметры;
КонецПроцедуры

&НаСервере
Функция НайтиПВХПоКоду(Код)
 	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду(Код); 
КонецФункции // НайтиПВХПоКоду()

&НаКлиенте
Процедура СтадияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Отчет.ОтчетПоВзысканию.Форма.ФормаПеречисления");
	Форма.Список = Стадия;
	Форма.ОткрытьМодально();
	СтадияТекст = Форма.Результат;    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСтадий()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КартыМаршрутов.Ссылка,
	                      |	КартыМаршрутов.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.КартыМаршрутов КАК КартыМаршрутов
	                      |ГДЕ
	                      |	(НЕ КартыМаршрутов.ПометкаУдаления)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл 
		Стадия.Добавить(Результат.Ссылка, Результат.Наименование);	
	КонецЦикла;
	Стадия.Добавить(Перечисления.СостоянияДел.МировоеСоглашение, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.МировоеСоглашение.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ОтказОтИска, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ОтказОтИска.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПолученоСвидетельство, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПолученоСвидетельство.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПредоставленаОтсрочка, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПредоставленаОтсрочка.Синоним);
	Стадия.Добавить(Перечисления.СостоянияДел.ПеречисленыДенежныеСредства, Метаданные.Перечисления.СостоянияДел.ЗначенияПеречисления.ПеречисленыДенежныеСредства.Синоним);
КонецПроцедуры	

&НаСервере
Процедура ОтобратьПоСтадии(Таблица)
	МассивСтадий = Новый Массив();	
	ФлагПоискаМС = Ложь;
	ФлагПоискаОИ = Ложь;
	ФлагПоискаПО = Ложь;
	ФлагПоискаПС = Ложь;
	ФлагПоискаПД = Ложь;
	Для Каждого Элемент Из Стадия Цикл
		Если Элемент.Пометка Тогда
			Если ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.КартыМаршрутов") Тогда
				МассивСтадий.Добавить(Элемент.Значение);			
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.МировоеСоглашение Тогда
				ФлагПоискаМС = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ОтказОтИска Тогда
				ФлагПоискаОИ = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПредоставленаОтсрочка Тогда
				ФлагПоискаПО = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПолученоСвидетельство Тогда
				ФлагПоискаПС = Истина;
			ИначеЕсли Элемент.Значение = Перечисления.СостоянияДел.ПеречисленыДенежныеСредства Тогда
				ФлагПоискаПД = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
							  
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.ДолговоеОбязательство
	                      |ПОМЕСТИТЬ Таблица
	                      |ИЗ
	                      |	&Таблица КАК Таблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Мероприятие.Ссылка,
	                      |	ЕСТЬNULL(Мероприятие.Объект.Владелец, Мероприятие.Объект) КАК Объект,
	                      |	Мероприятие.Схема,
	                      |	Мероприятие.БизнесПроцесс,
	                      |	Мероприятие.Результат,
	                      |	Мероприятие.Дата,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Выполнена,
	                      |	Мероприятие.ТипМероприятия
	                      |ПОМЕСТИТЬ ТаблицаМ
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	НЕ Мероприятие.ПометкаУдаления
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Таблица.ДолговоеОбязательство,
	                      |	МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) + МАКСИМУМ(ВЫБОР
	                      |			КОГДА МероприятиеПД.Ссылка ЕСТЬ NULL 
	                      |				ТОГДА ""0""
	                      |			ИНАЧЕ ""1""
	                      |		КОНЕЦ) КАК СтадияФлаг
	                      |ИЗ
	                      |	Таблица КАК Таблица
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеСтадии
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеСтадии.Объект
	                      |			И (МероприятиеСтадии.Схема В (&МассивСтадий))
	                      |			И (МероприятиеСтадии.ДатаВыполнения > &ТекДата
	                      |				ИЛИ НЕ МероприятиеСтадии.Выполнена)
	                      |			И (МероприятиеСтадии.Дата < &ТекДата)
	                      |			И (НЕ МероприятиеСтадии.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеМС
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеМС.Объект
	                      |			И (МероприятиеМС.Выполнена)
	                      |			И (МероприятиеМС.Результат В (&МассивРезультатовМС))
	                      |			И (МероприятиеМС.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеМС.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеМС.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеОИ
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеОИ.Объект
	                      |			И (МероприятиеОИ.Выполнена)
	                      |			И (МероприятиеОИ.Результат В (&МассивРезультатовОИ))
	                      |			И (МероприятиеОИ.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеОИ.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеОИ.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеПО
	                      |		ПО (Таблица.ДолговоеОбязательство = ЕСТЬNULL(МероприятиеПО.Ссылка.Объект.Владелец, МероприятиеПО.Ссылка.Объект))
	                      |			И (МероприятиеПО.Ссылка.Выполнена)
	                      |			И (МероприятиеПО.Свойство В (&МассивРезультатовПО))
	                      |			И (МероприятиеПО.Значение >= &ТекДата)
	                      |			И (МероприятиеПО.Ссылка.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПО.Ссылка.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПО.Ссылка.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеПС
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеПС.Объект
	                      |			И (МероприятиеПС.Выполнена)
	                      |			И (МероприятиеПС.Результат В (&МассивРезультатовПС))
	                      |			И (МероприятиеПС.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПС.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПС.БизнесПроцесс.ПометкаУдаления)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМ КАК МероприятиеПД
	                      |		ПО Таблица.ДолговоеОбязательство = МероприятиеПД.Объект
	                      |			И (МероприятиеПД.Выполнена)
	                      |			И (МероприятиеПД.ТипМероприятия В (&МассивТиповМероприятийПД))
	                      |			И (МероприятиеПД.ДатаВыполнения < &ТекДата)
	                      |			И (МероприятиеПД.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
	                      |				ИЛИ НЕ МероприятиеПД.БизнесПроцесс.ПометкаУдаления)
	                      |ГДЕ
	                      |	(&ФлагБезУсловий
	                      |			ИЛИ НЕ МероприятиеСтадии.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |			ИЛИ НЕ МероприятиеПД.Ссылка ЕСТЬ NULL )
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Таблица.ДолговоеОбязательство
	                      |
	                      |ИМЕЮЩИЕ
	                      |	(&ФлагБезУсловий
	                      |		ИЛИ &ФлагПоискаСтадии
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеСтадии.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаМС
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеМС.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаОИ
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеОИ.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПО
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПО.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПС
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПС.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1
	                      |		ИЛИ &ФлагПоискаПД
	                      |			И МАКСИМУМ(ВЫБОР
	                      |					КОГДА МероприятиеПД.Ссылка ЕСТЬ NULL 
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 1
	                      |				КОНЕЦ) = 1)");					  						  
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("МассивСтадий", МассивСтадий);
	Запрос.УстановитьПараметр("ФлагБезУсловий", МассивСтадий.Количество() = 0 И Не ФлагПоискаМС И Не ФлагПоискаОИ И 
			Не ФлагПоискаПО И Не ФлагПоискаПС И Не ФлагПоискаПД);
	Запрос.УстановитьПараметр("ТекДата", КонецДня(ДатаОтчета));	
	
	Запрос.УстановитьПараметр("ФлагПоискаСтадии", МассивСтадий.Количество() > 0);
	Запрос.УстановитьПараметр("ФлагПоискаМС", ФлагПоискаМС);
	Запрос.УстановитьПараметр("ФлагПоискаОИ", ФлагПоискаОИ);
	Запрос.УстановитьПараметр("ФлагПоискаПО", ФлагПоискаПО);
	Запрос.УстановитьПараметр("ФлагПоискаПС", ФлагПоискаПС);
	Запрос.УстановитьПараметр("ФлагПоискаПД", ФлагПоискаПД);
			
	МассивРезультатовМС = Новый Массив();	
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0220"));
	МассивРезультатовМС.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0315"));
	
	МассивРезультатовОИ = Новый Массив();
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0321"));
	МассивРезультатовОИ.Добавить(Справочники.РезультатыМероприятий.НайтиПоКоду("     0322"));
	
	Запрос.УстановитьПараметр("МассивРезультатовМС", МассивРезультатовМС);
	Запрос.УстановитьПараметр("МассивРезультатовОИ", МассивРезультатовОИ);
	Запрос.УстановитьПараметр("МассивРезультатовПО", 
			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоКоду("     2051")); //ДопРеквизитыМероприятий
			//Справочники.РезультатыМероприятий.НайтиПоКоду("     0320"));
	Запрос.УстановитьПараметр("МассивРезультатовПС", Справочники.РезультатыМероприятий.НайтиПоКоду("     0216"));
	Запрос.УстановитьПараметр("МассивТиповМероприятийПД", Справочники.ТипыМероприятий.НайтиПоКоду("     0083"));
	
	Таблица = Запрос.Выполнить().Выгрузить();
КонецПроцедуры
